feature_names_mapping = {
    'age': 'Ηλικία',
    'sex': 'Φύλο',
    'cp': 'Τύπος Θωρακικού Πόνου',
    'trestbps': 'Αρτηριακή Πίεση Ηρεμίας (mm Hg)',
    'chol': 'Χοληστερίνη (mg/dl)',
    'fbs': 'Σάκχαρο Νηστείας (> 120 mg/dl)',
    'restecg': 'Ηλεκτροκαρδιογράφημα Ηρεμίας',
    'thalach': 'Μέγιστη Καρδιακή Συχνότητα',
    'exang': 'Πρόκληση πόνου κατά την άσκηση​',
    'oldpeak': 'Κατάσπαση διαστήματος ST',
    'slope': 'Κλίση διαστήματος ST',
    'ca': 'Αριθμός Στεφανιαίων Αγγείων​',
    'thal': 'Αποτέλεσμα δοκιμασίας κόπωσης με θάλλιο​'
}

sex_mapping = {
    0: "Γυναίκα", 
    1: "Άνδρας"
}

cp_mapping = {
    0: "Ασυμπτωματικός (0)",
    1: "Άτυπη στηθάγχη (1)",
    2: "Μη στηθαγχικός πόνος (2)",
    3: "Τυπική στηθάγχη (3)"
}

fbs_mapping = {
    0: "Όχι / Μικρότερο από 120 mg/dl (0)",
    1: "Ναι / Μεγαλύτερο από 120 mg/dl (1)"
}

restecg_mapping = {
    0: "Υπερτροφία αριστερής κοιλίας (0)",
    1: "Φυσιολογικό (1)",
    2: "Ανωμαλία κύματος ST-T (2)"
}

exang_mapping = {
    0: "Όχι (0)",
    1: "Ναι (1)"
}

slope_mapping = {
    0: "Καθοδική (0)",
    1: "Επίπεδη (1)",
    2: "Ανοδική (2)"
}

thal_mapping = {
    1: "Σταθερό ελάττωμα (1)",
    2: "Φυσιολογική (2)",
    3: "Αναστρέψιμο ελάττωμα (3)"
}