feature_names_mapping = {
    'age': 'Ηλικία (Έτη)',
    'sex': 'Φύλο',
    'cp': 'Τύπος Θωρακικού Άλγους',
    'trestbps': 'Αρτηριακή Πίεση Ηρεμίας (mm Hg)',
    'chol': 'Χοληστερόλη Ορού (mg/dl)',
    'fbs': 'Σάκχαρο Νηστείας (> 120 mg/dl)',
    'restecg': 'Ηλεκτροκαρδιογράφημα Ηρεμίας',
    'thalach': 'Μέγιστη Καρδιακή Συχνότητα',
    'exang': 'Στηθάγχη Προσπάθειας (Λόγω άσκησης)',
    'oldpeak': 'Κατάσπαση διαστήματος ST',
    'slope': 'Κλίση διαστήματος ST',
    'ca': 'Αριθμός Κύριων Αγγείων (Φθοριοσκοπία)',
    'thal': 'Αιμάτωση (Θαλασσαιμία)'
}

sex_mapping = {
    0: "Γυναίκα", 
    1: "Άνδρας"
}

cp_mapping = {
    0: "Ασυμπτωματικός (0)",
    1: "Τυπική στηθάγχη (1)",
    2: "Άτυπη στηθάγχη (2)",
    3: "Μη στηθαγχικός πόνος (3)"
}

fbs_mapping = {
    0: "Όχι / Μικρότερο από 120 mg/dl (0)",
    1: "Ναι / Μεγαλύτερο από 120 mg/dl (1)"
}

restecg_mapping = {
    0: "Φυσιολογικό (0)",
    1: "Ανωμαλία κύματος ST-T (1)",
    2: "Υπερτροφία αριστερής κοιλίας (2)"
}

exang_mapping = {
    0: "Όχι (0)",
    1: "Ναι (1)"
}

slope_mapping = {
    0: "Ανοδική (0)",
    1: "Επίπεδη (1)",
    2: "Καθοδική (2)"
}

thal_mapping = {
    1: "Φυσιολογική (1)",
    2: "Σταθερό ελάττωμα (2)",
    3: "Αναστρέψιμο ελάττωμα (3)"
}